Tekla Open API Reference for Tekla Structures 2025
FormBase.UpdateValues Method
Note: This API is now obsolete.
 Rereads and updates all the field values on the form.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Does currently nothing. Will be removed in near future.")]
public void UpdateValues()
<ObsoleteAttribute("Does currently nothing. Will be removed in near future.")>
Public Sub UpdateValues
See Also
Reference
FormBase Class
Tekla.Structures.Dialog Namespace